---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.InvalidInput
source: html/b1848162-f897-a6ae-8779-6e0f7d63859e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.InvalidInput Property

Invalid Input

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidInput { get; }
```